#pragma once

			//**********************************************//
			//*                                            *//
			//*                                            *//
			//*             //////////////////             *//
			//*            //****************//            *//
			//*           //*                *//           *//
			//*          //*       SGM2       *//          *//
			//*         //*                    *//         *//
			//*          //*     Ver 2.02     *//          *//
			//*           //*                *//           *//
			//*            //****************//            *//
			//*             //////////////////             *//
			//*                                            *//
			//*                                            *//
			//**********************************************//

#include "./std.h"
#include "./Component.hpp"
#include "./Object.h"
#include "./Position.hpp"
#include "./GameState.h"
#include "./GameStateManager.h"

#define SUPER_GAME_MAKER2

// 変更履歴
// 
// ● Ver 2.00 -> 2.01
//
// ActionTest01～03と並行開発
// ・plusの中身をフォルダ分けし、namespaceも分けた。
// 
//
// ● Ver 2.00 -> 2.01
//
// テストプログラムと並行開発
// 
// ・初期ステートなしでGSMを初期化した際のバグ修正
// ・GSの遷移予約で、呼び出し元のGS指定ができるようにした
// ・GSMの生成失敗時に例外が飛ぶようにした（以前はnullptrを返していた）。
// ・GSMの初期ステート指定にユニークポインタを使えるようにした
// ・コンポーネントにready関数を追加
// ・コンポーネントのコンストラクタから親オブジェクトを外し、add_componentでセットするようにした
// もっとたくさんあるけど、変更多すぎて書くのあきらめちゃった
// 
// 
//
// ★★★ Ver 1.04 -> 2.00 ★★★
//
// 「3D World 01」 と並行開発
// 開発は前のバージョンアップと同時進行だけど、メジャーバージョンが変わったので別枠で
//
// ・描画処理をカメラオブジェクトに委譲
//		非常に大きな変化なので、メジャーバージョンを変更した
//		今まではGSが描画も担当していたのだが、これをカメラに委譲
//		GSから描画用オブジェクトの配列削除した
//		代わりに各カメラが描画用のオブジェクトを保持する
//		さらに、Object.draw がカメラで計算した値を受け取るようになった
//		今までユーザーに提供されていた拡張対象は、GS, Object, Componentの3つであった
//		今回、ここに Camera が加わることとなる
//		Cameraを定義することで、描画の仕方をより細かく制御できるようになった
//
//
//
// ● Ver 1.03 -> 1.04
//
// 「3D World 01」 と並行開発
// 
// ・型指定でGSやオブジェクトから子要素（オブジェクト）を取得できるようにした
//		!!!!! オブジェクトにある、get_child_by_type は要テスト !!!!!
//		孫まで探索できるかの確認ができていない
//
// ・オブジェクトにinit関数を実装
//		初回更新時に1回だけコールされる
//		GSが絡む処理をコンストラクタから扱うことはできないため、init関数を使う
//
// ・Unilityファイルを作成し、Vecクラスを追加
//		Vec3を回転させる関数などを用意
//
// ・get系関数の調整
//		objectやcomponentをgetする際、型名の比較ではなくダウンキャストの可否で判定するようにした
//		型名比較だと、複数回継承したケースに対応できないと思われるからだ
//		今回の変更でうまく対応できるのかどうかは、テストしてないのでわかりません
//
// ・GSのフラグや設定を構造体にまとめた
//
// 
//
// ● Ver 1.02 -> 1.03
//
// ノードゲームと並行して作成
//
// ・Objectが子オブジェクトを持てるようにした
//		現状では親を消すと子も消えるぐらいで、これといった機能は特にない
//		Z値ソートや優先度ソートは、同じ階層の子オブジェクト同士にのみ適用される
//
// ・sgmPlus.h に random と gsm を追加
//		今まではGlobal.hをユーザーが用意し、そこに記述する形となっていた
//		gsmは必須だし、randomはあった方が便利だからデフォで用意しよう
// 
//
// 
// ● Ver 1.01 -> 1.02
//
// ドライブゲームと並行して作成
// 
// ・Positionを(x, y)から(x, y, z)に変更
// 
// ・GameStateが同じオブジェクトを2つの配列で保持するようにした
//		update用に優先度でソートするもの、draw用にZ値でソートするもの、の2つ
//		同じものを2つずつ持つのは、無駄が多いしバグが怖い
//		まあ、仕方ないってことで
//		Zソートのタイミングは、priority同様オブジェクトを追加したときのみ
//		設定を変えれば、毎フレームソートすることもできる
// 
// ・PositionをObjectに標準装備
//		描画でZ値が必要になったため
//
// ・add_objectがshared_ptrを返すようにした
//		元の戻り値はvoidだった
//		add_componentはshared_ptrを返していたのに
//
// 
//
// ● Ver 1.00 -> 1.01
//
// カラーゲームの開発と並行して作成
//
// ・がっつり変えすぎて何したか覚えてない
//		1.00と1.01は完全に別物
//		そもそも1.00は DXLib ベースだし
//		当たり判定システム入れたり、ちょっと機能を減らしたり
//		そんな感じかな？
//
// 
//
// ● SGM（Super Game Maker） -> SGM2
//
// ・SGMは開発が頓挫したためSGM2に移行
//		描画関係やカメラ機能はSGMの方が充実していた
//		というか、現在（Ver1.02）はカメラとかないし
//
